## Missing Data

In [9]:
import numpy as np
import pandas as pd

In [12]:
df=pd.DataFrame({'A':[1,np.nan,3],
                 'B':[5,np.nan,np.nan],
                 'C':[np.nan,np.nan,np.nan],
                 'D':[np.nan,6,7],
                 'E':[8,9,10]})

In [13]:
df

     A    B   C    D   E
0  1.0  5.0 NaN  NaN   8
1  NaN  NaN NaN  6.0   9
2  3.0  NaN NaN  7.0  10

In [15]:
df.dropna()

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

In [16]:
df.dropna(axis=1)

    E
0   8
1   9
2  10

In [17]:
df

     A    B   C    D   E
0  1.0  5.0 NaN  NaN   8
1  NaN  NaN NaN  6.0   9
2  3.0  NaN NaN  7.0  10

In [19]:
df.fillna(value="9")

     A    B  C    D   E
0  1.0  5.0  9    9   8
1    9    9  9  6.0   9
2  3.0    9  9  7.0  10

In [ ]:
data=pd.read_csv(r"C:\Users\sudha\Downloads\archive (1)\student_admission_record_dirty.csv")
data

In [28]:
data={ 
    'Name':['Shehroz','Waqar','Bushra','Aliya'],
    'Age':[24,  21,  17,  18],
    'Gender':['Male','Male','Female','Female'],
    }

In [29]:
data=pd.DataFrame(data)
data

      Name  Age  Gender
0  Shehroz   24    Male
1    Waqar   21    Male
2   Bushra   17  Female
3    Aliya   18  Female

In [41]:
a=data.groupby("Age")
a

In [33]:
a.mean(numeric_only=True)

          Age
Name
Aliya    18.0
Bushra   17.0
Shehroz  24.0
Waqar    21.0

In [34]:
a.std(numeric_only=True)

         Age
Name
Aliya    NaN
Bushra   NaN
Shehroz  NaN
Waqar    NaN

In [ ]:
a.max(numeric_only=True)

In [39]:
a.min(numeric_only=True)

         Age
Name
Aliya     18
Bushra    17
Shehroz   24
Waqar     21

In [37]:
data.isnull().sum()

Name      0
Age       0
Gender    0
dtype: int64